{
  "auto_mapping": null,
  "base_model_name_or_path": "gpt2",
  "bias": "none",
  "fan_in_fan_out": true,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 4,
  "lora_dropout": 0.3,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "revision": null,
  "target_modules": [
    "c_attn"
  ],
  "task_type": "SEQ_CLS"
}